# Запитуємо перше число
number_1_str = input("Введіть перше число: ")
# Запитуємо друге число
number_2_str = input("Введіть друге число: ")
# Запитуємо, яку дію потрібно виконати
operation = input("Введіть дію (+, -, *, /): ")


# Перетворюємо рядки, що містять числа, на дробовий тип `float`,
# щоб працювати як з цілими, так і з дробовими числами
number_1 = float(number_1_str)
number_2 = float(number_2_str)


# Перевіряємо, який символ операції ввів користувач
if operation == '+':
    # якщо це '+', виконуємо додавання
    result = number_1 + number_2
    print("Результат:", result)

elif operation == '-':
    # якщо це '-', виконуємо віднімання
    result = number_1 - number_2
    print("Результат:", result)

elif operation == '*':
    # якщо це '*', виконуємо множення
    result = number_1 * number_2
    print("Результат:", result)

elif operation == '/':
    # якщо це '/', переходимо до спеціальної перевірки

    if number_2 == 0:
        # якщо дільник (друге число) дорівнює нулю, виводимо повідомлення про помилку
        print("Помилка! Ділення на нуль неможливе.")
    else:
        # в іншому випадку, безпечно виконуємо ділення
        result = number_1 / number_2
        print("Результат:", result)

else:
    # "Страховка": якщо користувач ввів невідомий символ операції
    print("Помилка! Введено невірну дію. Будь ласка, використовуйте +, -, * або /.")