# Піраміда з даними.
hill = [[7],
        [5, 8],
        [9, 8, 2],
        [1, 3, 5, 6],
        [6, 2, 4, 4, 5],
        [9, 5, 3, 5, 5, 7],
        [7, 4, 6, 4, 7, 6, 8]]

# Ітеруємо по рядах знизу вгору, починаючи з передостаннього.
for i in range(len(hill) - 2, -1, -1):
    # Ітеруємо по елементах у кожному ряду.
    for j in range(len(hill[i])):
        # Оновлюємо поточну комірку, додаючи до неї максимум з двох нижніх.
        hill[i][j] += max(hill[i+1][j], hill[i+1][j+1])

# Результат накопичується у верхньому елементі.
max_gold = hill[0][0]

print(f"Максимальна кількість золота: {max_gold}")